// Створіть змінну, що симулює вибір варіанта зі списку. Виводьте повідомлення залежно від обраного варіанта: "Кава", "Чай" або "Сік". Використайте switch
const whatWant = prompt("Що ви хочете (на вибрів: Кава, Чай або Сік)");
switch (whatWant) {
    case "Кава":
        alert("За декілька хвилин вам принесуть Каву!");
        break;
    case "Чай":
        alert("За декілька хвилин вам принесуть Чай!");
        break;
    case "Сік":
        alert("За декілька хвилин вам принесуть Сік!");
        break;
    default:
        alert("В нас такого немає(");
        break;
}
// Створіть змінну для зберігання введеного рядка, який може бути днем тижня. Якщо це робочий день — виведіть повідомлення про робочий день, якщо вихідний — про вихідний.
const whatDay = prompt("Виберіть день тижня");
switch (whatDay) {
    case "Понеділок":
        alert("Сьогодні робочий день!");
        break;
    case "Вівторок":
        alert("Сьогодні робочий день!");
        break;
    case "Середа":
        alert("Сьогодні робочий день!");
        break;
    case "Четверг":
        alert("Сьогодні робочий день!");
        break;
    case "П'ятниця":
        alert("Сьогодні робочий день!");
        break;
    case "Субота":
        alert("Сьогодні вихідний день!");
        break;
    case "Неділя":
        alert("Сьогодні вихідний день!");
        break;
    default:
        alert("Немає такого дня!");
}

// Створіть змінну для зберігання номера місяця. За номером місяця визначайте пору року і виводьте відповідне повідомлення.

const whatMonth = Number(prompt("Напишіть який місяць (1-12)"));

switch (whatMonth) {
    case 1, 2:
        alert("Зима")
        break;
    case 3, 4, 5:
        alert("Весна")
        break;
    case 6, 7, 8:
        alert("Літо")
        break;
    case 9, 10, 11:
        alert("Осінь")
        break;
    case 12:
        alert("Зима")
        break;
    default:
        alert("Немає такого місяця!");
}

// Створіть змінну для зберігання назви кольору. Виводьте повідомлення відповідно до вибраного кольору: якщо "червоний" — "стоп", "зелений" — "йти", "жовтий" — "чекати".
const whatColor = prompt("Виберіть колір(червоний,жовтий,зелений)")

switch (whatColor) {
    case "зелений":
        alert("Йдіть")
        break;
    case "жовтий":
        alert("Будьте готові")
        break;
    case "червоний":
        alert("Стоп!")
        break;

    default:
        alert("Ви вибрали не той колір!")
}


// Створіть змінні для зберігання двох чисел та оператора (як у списку select). Виконайте відповідну операцію та виведіть результат. У випадку ділення на нуль — виведіть попередження.
const a = 6;
const b = 2;
if (a / b) {
    alert("Все правильно!")
} else {
    alert("Попередження!")
}
